; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v13 ?v9)
             (pred_7 ?v1 ?v7)
             (pred_6 ?v13 ?v7)
             (pred_2 ?v2 ?v13 )
	     (pred_1 ?v13)
             (pred_12 ?v10)
             (pred_10 ?v1)
             (pred_11 ?v7)
             (pred_3 ?v13)
             (pred_5 ?v1)
             (pred_9 ?v13)
             (pred_4 ))



(:action op_5
:parameters (?v11 ?v3 ?v4 ?v12)
:precondition (and (pred_12 ?v11) (pred_12 ?v3) (pred_10 ?v4) (pred_11 ?v12)
          (pred_8 ?v11 ?v3) (pred_7 ?v4 ?v12)
                   (pred_6 ?v3 ?v12) (pred_1 ?v11) 
                   (pred_3 ?v3) (pred_5 ?v4))
:effect (and  (pred_9 ?v3) (not (pred_3 ?v3))))


(:action op_1
:parameters (?v11 ?v6)
:precondition (and (pred_12 ?v11) (pred_12 ?v6)
               (pred_1 ?v11) (pred_8 ?v11 ?v6) (pred_9 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v11))))

(:action op_2
:parameters (?v11 ?v4)
:precondition (and (pred_12 ?v11) (pred_10 ?v4) 
                  (pred_1 ?v11) (pred_2 ?v4 ?v11) (pred_4 ))
:effect (and (pred_5 ?v4)
   (not (pred_2 ?v4 ?v11)) (not (pred_4 ))))


(:action op_3
:parameters (?v11 ?v8 ?v5)
:precondition (and (pred_12 ?v11) (pred_10 ?v8) (pred_10 ?v5)
                  (pred_1 ?v11) (pred_5 ?v5) (pred_2 ?v8 ?v11))
:effect (and (pred_5 ?v8) (pred_2 ?v5 ?v11)
        (not (pred_5 ?v5)) (not (pred_2 ?v8 ?v11))))

(:action op_4
:parameters (?v11 ?v4)
:precondition (and (pred_12 ?v11) (pred_10 ?v4) 
                  (pred_1 ?v11) (pred_5 ?v4))
:effect (and (pred_4 ) (pred_2 ?v4 ?v11) (not (pred_5 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_05 obj_01 obj_18 obj_06 obj_22 obj_28 obj_02 obj_29 obj_10 obj_13 obj_08 obj_26 obj_11 obj_04 obj_12 obj_15 obj_09 obj_17 obj_03 obj_20 obj_21 obj_27 obj_24 obj_19
    obj_07 obj_16
    obj_30 obj_25 obj_23
    )

    (:init
       (pred_4)

       (pred_12 obj_14)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_18)
       (pred_12 obj_06)
       (pred_12 obj_22)
       (pred_12 obj_28)
       (pred_12 obj_02)
       (pred_12 obj_29)
       (pred_12 obj_10)
       (pred_12 obj_13)
       (pred_12 obj_08)
       (pred_12 obj_26)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_12)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_17)
       (pred_12 obj_03)
       (pred_12 obj_20)
       (pred_12 obj_21)
       (pred_12 obj_27)
       (pred_12 obj_24)
       (pred_12 obj_19)
       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_10 obj_30)
       (pred_10 obj_25)
       (pred_10 obj_23)

       (pred_8 obj_14 obj_22)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_05 obj_28)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_18 obj_29)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_06 obj_10)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_22 obj_13)
       (pred_8 obj_22 obj_28)
       (pred_8 obj_22 obj_14)
       (pred_8 obj_28 obj_08)
       (pred_8 obj_28 obj_02)
       (pred_8 obj_28 obj_05)
       (pred_8 obj_28 obj_22)
       (pred_8 obj_02 obj_26)
       (pred_8 obj_02 obj_29)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_02 obj_28)
       (pred_8 obj_29 obj_11)
       (pred_8 obj_29 obj_10)
       (pred_8 obj_29 obj_18)
       (pred_8 obj_29 obj_02)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_10 obj_29)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_22)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_26)
       (pred_8 obj_08 obj_28)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_26 obj_09)
       (pred_8 obj_26 obj_11)
       (pred_8 obj_26 obj_02)
       (pred_8 obj_26 obj_08)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_11 obj_29)
       (pred_8 obj_11 obj_26)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_15 obj_21)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_09 obj_27)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_09 obj_26)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_17 obj_24)
       (pred_8 obj_17 obj_03)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_17 obj_09)
       (pred_8 obj_03 obj_19)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_17)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_21 obj_27)
       (pred_8 obj_21 obj_15)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_27 obj_24)
       (pred_8 obj_27 obj_09)
       (pred_8 obj_27 obj_21)
       (pred_8 obj_24 obj_19)
       (pred_8 obj_24 obj_17)
       (pred_8 obj_24 obj_27)
       (pred_8 obj_19 obj_03)
       (pred_8 obj_19 obj_24)
       (pred_3 obj_27)
       (pred_3 obj_28)
       (pred_3 obj_09)
       (pred_6  obj_27 obj_07)
       (pred_6  obj_28 obj_16)
       (pred_6  obj_09 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_9 obj_18)
       (pred_9 obj_06)
       (pred_9 obj_22)
       (pred_9 obj_02)
       (pred_9 obj_29)
       (pred_9 obj_10)
       (pred_9 obj_13)
       (pred_9 obj_08)
       (pred_9 obj_26)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_12)
       (pred_9 obj_15)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_21)
       (pred_9 obj_24)
       (pred_9 obj_19)

       (pred_7  obj_30 obj_07)
       (pred_7  obj_25 obj_16)
       (pred_7  obj_23 obj_16)
       (pred_2 obj_30 obj_03)
       (pred_2 obj_25 obj_15)
       (pred_2 obj_23 obj_11)
       (pred_1 obj_20)
    )

    (:goal (and
       (pred_2 obj_25 obj_02)
       (pred_2 obj_23 obj_03)
    ))
(:constraints
  (always (not (pred_1 obj_26)))
)
)

; plan
1. (op_1 obj_20 obj_21)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_21)
   goals met: 0 of 2
2. (op_1 obj_21 obj_15)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_15)
   goals met: 0 of 2
3. (op_2 obj_15 obj_25)
   deleted: (pred_2 obj_25 obj_15) (pred_4)
   added: (pred_5 obj_25)
   goals met: 0 of 2
4. (op_1 obj_15 obj_08)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_08)
   goals met: 0 of 2
5. (op_5 obj_08 obj_28 obj_25 obj_16)
   deleted: (pred_3 obj_28)
   added: (pred_9 obj_28)
   goals met: 0 of 2
6. (op_1 obj_08 obj_28)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_28)
   goals met: 0 of 2
7. (op_1 obj_28 obj_02)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_02)
   goals met: 0 of 2
8. (op_4 obj_02 obj_25)
   deleted: (pred_5 obj_25)
   added: (pred_4) (pred_2 obj_25 obj_02)
   goals met: 1 of 2
9. (op_1 obj_02 obj_29)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_29)
   goals met: 1 of 2
10. (op_1 obj_29 obj_11)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_11)
   goals met: 1 of 2
11. (op_2 obj_11 obj_23)
   deleted: (pred_2 obj_23 obj_11) (pred_4)
   added: (pred_5 obj_23)
   goals met: 1 of 2
12. (op_1 obj_11 obj_04)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_04)
   goals met: 1 of 2
13. (op_1 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 1 of 2
14. (op_3 obj_03 obj_30 obj_23)
   deleted: (pred_5 obj_23) (pred_2 obj_30 obj_03)
   added: (pred_5 obj_30) (pred_2 obj_23 obj_03)
   goals met: 2 of 2
